Revit 2027 API
MultiReferenceAnnotationOptions.DimensionPlaneNormal Property
 The normal vector to the dimension plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ DimensionPlaneNormal { get; set; }
Public Property DimensionPlaneNormal As XYZ
	Get
	Set
public:
property XYZ^ DimensionPlaneNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
member DimensionPlaneNormal : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
ArgumentOutOfRangeException |  When setting this property: dimensionPlaneNormal is not length 1.0.
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace